import React, { useState, useEffect, useRef } from 'react';
import '../styles/IceEdger.css';


const IceEdger = ({ imageUrl }) => {
    const [isVisible, setIsVisible] = useState(false);
    const componentRef = useRef(null);


    useEffect(() => {
        const observer = new IntersectionObserver(
            (entries) => {
                entries.forEach((entry) => {
                    if (entry.isIntersecting) {
                        setIsVisible(true);
                        observer.unobserve(entry.target);
                    }
                });
            },
            {
                threshold: 0.2,
            }
        );

        if (componentRef.current) {
            observer.observe(componentRef.current);
        }

        return () => {
            if (componentRef.current) {
                observer.unobserve(componentRef.current);
            }
        };
    }, []);

    const paragraphs = [
        "Бортоподрезная машина для льда — это машина, предназначенная для подрезки и выравнивания льда вдоль бортов катка после его заливки.",
        "Конструкция машины представляет собой колёсную платформу с установленным на ней бензиновым двигателем, вращающим диск с резцами, оснащёнными твёрдосплавными пластинами. Резцы выравнивают поверхность льда, срезая его неровности на расстоянии до 2 мм от борта.",
        "",
    ];

    return (
        <div className={`ice-edger ${isVisible ? 'fade-in' : ''}`} ref={componentRef}>
             <div className="tractor-icon-container">
                <svg
                   className="tractor-icon"
                    xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 512 512 "
                  >
                   <path d="M175.436,314.913c-.783-.658-1.53-1.246-2.249-1.774a55.015,55.015,0,0,0-65.562-.01,53.752,53.752,0,0,0-6.062,5.226,55.005,55.005,0,1,0,73.873-3.442ZM140.4,398.3a40.995,40.995,0,0,1-28.934-70.042,39.658,39.658,0,0,1,4.5-3.876,41.014,41.014,0,0,1,48.909.024c.5.37,1.015.773,1.611,1.274A40.99,40.99,0,0,1,140.4,398.3Z"/><path d="M203.43,280.976c-1.279-1.077-2.632-2.144-4.014-3.17a99.823,99.823,0,1,0,4.014,3.17ZM140.4,442.3A85,85,0,0,1,80.389,297.1a85,85,0,0,1,110.68-8.058c1.161.861,2.287,1.75,3.4,2.687A84.987,84.987,0,0,1,140.4,442.3Z"/><path d="M382.674,304.393a7,7,0,0,0,7-7l0-43.873a7,7,0,0,0-14,0l0,43.873A7,7,0,0,0,382.674,304.393Z"/><path d="M403.1,304.393a7,7,0,0,0,7-7l0-43.873a7,7,0,0,0-14,0l0,43.873A7,7,0,0,0,403.1,304.393Z"/><path d="M424,304.393a7,7,0,0,0,7-7V253.52a7,7,0,1,0-14,0v43.873A7,7,0,0,0,424,304.393Z"/><path d="M469.115,336.589l14.853-57.074a7.641,7.641,0,0,0,0-3.666c-.532-2.07-13.427-50.849-48.355-50.849H400V62.7c0-3.866-3.554-6.7-7.42-6.7H375.073A6.816,6.816,0,0,0,368,62.7V225H295.831l-34.3-128.106A10.781,10.781,0,0,0,250.905,89H129.079a10.917,10.917,0,0,0-10.81,8.868L95.292,220H69.3a7,7,0,0,0-5.059,2.158l-36.831,38.5A10.818,10.818,0,0,0,35.361,279H54.352a7.083,7.083,0,0,0,5.041-2.229L81.245,254H206.954l58.417,92.84a10.96,10.96,0,0,0,9.31,5.16h92.564A69.061,69.061,0,0,0,357,388.1a68,68,0,1,0,112.115-51.515ZM382,70h4V225h-4ZM217.92,245.16a10.958,10.958,0,0,0-9.31-5.16H78.269a7.084,7.084,0,0,0-5.042,2.229L51.375,265H42.382l29.911-31H101.1a6.912,6.912,0,0,0,6.879-5.606L131.568,103H248.6l35.091,131.073A6.771,6.771,0,0,0,290.456,239H435.618c21.253,0,32.009,31.124,34.318,38.685l-13.1,50.431a68.6,68.6,0,0,0-72.366,5.362C382.5,334.94,380.6,337,378.809,338H276.337ZM425,442.3a54,54,0,0,1-38.12-92.244,53.98,53.98,0,0,1,69.215-5.9,6.941,6.941,0,0,0,2.011,1.481c.409.319.822.651,1.249,1.009A53.991,53.991,0,0,1,425,442.3Z"/><path d="M446.38,362.477c-.457-.384-.925-.753-1.391-1.1a33.741,33.741,0,1,0,1.391,1.1ZM425,407.824a19.527,19.527,0,1,1,11.647-35.2c.247.182.488.372.777.615A19.523,19.523,0,0,1,425,407.824Z"/>
               </svg>
            </div>

            <h2 className="ice-edger-title">Бортоподрезная машина для льда</h2>
            <div className="ice-edger-content">
                <div className="ice-edger-text">
                    {paragraphs.map((paragraph, index) => (
                        paragraph && (
                            <p
                                key={index}
                                className="ice-edger-paragraph"
                                style={{ '--text-delay': index + 1 }}

                            >
                                {paragraph}
                            </p>
                        )
                    ))}
                </div>
                {imageUrl && (
                    <div className="ice-edger-image">
                        <img src={imageUrl} alt="Бортоподрезная машина для льда" />
                    </div>
                )}
            </div>
        </div>
    );
};

export default IceEdger;
